avrdudes/avr-libc/include/avr/ioavr16la32.h
/* USART.CTRLB  bit masks and bit positions */
#define USART_TXEN_bm  0x01  /* Transmitter enable bit mask. */
#define USART_TXEN_bp  0  /* Transmitter enable bit position. */
#define USART_RXEN_bm  0x02  /* Receiver enable bit mask. */
#define USART_RXEN_bp  1  /* Receiver enable bit position. */

/* USART.CTRLC  bit masks and bit positions */
#define USART_FORM_gm  0x07  /* Frame Format group mask. */
#define USART_FORM_gp  0  /* Frame Format group position. */
#define USART_FORM_0_bm  (1<<0)  /* Frame Format bit 0 mask. */
#define USART_FORM_0_bp  0  /* Frame Format bit 0 position. */
#define USART_FORM_1_bm  (1<<1)  /* Frame Format bit 1 mask. */
#define USART_FORM_1_bp  1  /* Frame Format bit 1 position. */
#define USART_FORM_2_bm  (1<<2)  /* Frame Format bit 2 mask. */
#define USART_FORM_2_bp  2  /* Frame Format bit 2 position. */
#define USART_SAMPR_bm  0x08  /* Sample Rate bit mask. */
#define USART_SAMPR_bp  3  /* Sample Rate bit position. */
#define USART_CPHA_bm  0x20  /* Clock Phase bit mask. */
#define USART_CPHA_bp  5  /* Clock Phase bit position. */
#define USART_DORD_bm  0x40  /* Data Order bit mask. */
#define USART_DORD_bp  6  /* Data Order bit position. */

/* USART.CTRLD  bit masks and bit positions */
#define USART_CHSIZE_gm  0x07  /* Character Size group mask. */
#define USART_CHSIZE_gp  0  /* Character Size group position. */
#define USART_CHSIZE_0_bm  (1<<0)  /* Character Size bit 0 mask. */
#define USART_CHSIZE_0_bp  0  /* Character Size bit 0 position. */
#define USART_CHSIZE_1_bm  (1<<1)  /* Character Size bit 1 mask. */
#define USART_CHSIZE_1_bp  1  /* Character Size bit 1 position. */
#define USART_CHSIZE_2_bm  (1<<2)  /* Character Size bit 2 mask. */
#define USART_CHSIZE_2_bp  2  /* Character Size bit 2 position. */
#define USART_SBMODE_bm  0x08  /* Stop Bit Mode bit mask. */
#define USART_SBMODE_bp  3  /* Stop Bit Mode bit position. */
#define USART_PMODE_gm  0x30  /* Parity Mode group mask. */
#define USART_PMODE_gp  4  /* Parity Mode group position. */
#define USART_PMODE_0_bm  (1<<4)  /* Parity Mode bit 0 mask. */
#define USART_PMODE_0_bp  4  /* Parity Mode bit 0 position. */
#define USART_PMODE_1_bm  (1<<5)  /* Parity Mode bit 1 mask. */
#define USART_PMODE_1_bp  5  /* Parity Mode bit 1 position. */

/* USART.CTRLE  bit masks and bit positions */
#define USART_MPCM_bm  0x01  /* Multi-processor Communication Mode bit mask. */
#define USART_MPCM_bp  0  /* Multi-processor Communication Mode bit position. */
#define USART_LBME_bm  0x02  /* Loop-back Mode Enable bit mask. */
#define USART_LBME_bp  1  /* Loop-back Mode Enable bit position. */
#define USART_ODME_bm  0x04  /* Open Drain Mode Enable bit mask. */
#define USART_ODME_bp  2  /* Open Drain Mode Enable bit position. */
#define USART_SFDEN_bm  0x08  /* Start Frame Detection Enable bit mask. */
#define USART_SFDEN_bp  3  /* Start Frame Detection Enable bit position. */
#define USART_COLDEN_bm  0x10  /* Collision Detection Enable bit mask. */
#define USART_COLDEN_bp  4  /* Collision Detection Enable bit position. */

/* USART.CTRLF  bit masks and bit positions */
#define USART_BRKLEN_gm  0x03  /* Break Length group mask. */
#define USART_BRKLEN_gp  0  /* Break Length group position. */
#define USART_BRKLEN_0_bm  (1<<0)  /* Break Length bit 0 mask. */
#define USART_BRKLEN_0_bp  0  /* Break Length bit 0 position. */
#define USART_BRKLEN_1_bm  (1<<1)  /* Break Length bit 1 mask. */
#define USART_BRKLEN_1_bp  1  /* Break Length bit 1 position. */
#define USART_GUARD_gm  0x0C  /* Guard Time group mask. */
#define USART_GUARD_gp  2  /* Guard Time group position. */
#define USART_GUARD_0_bm  (1<<2)  /* Guard Time bit 0 mask. */
#define USART_GUARD_0_bp  2  /* Guard Time bit 0 position. */
#define USART_GUARD_1_bm  (1<<3)  /* Guard Time bit 1 mask. */
#define USART_GUARD_1_bp  3  /* Guard Time bit 1 position. */
#define USART_INTDLY_gm  0xF0  /* Inter-byte Delay group mask. */
#define USART_INTDLY_gp  4  /* Inter-byte Delay group position. */
#define USART_INTDLY_0_bm  (1<<4)  /* Inter-byte Delay bit 0 mask. */
#define USART_INTDLY_0_bp  4  /* Inter-byte Delay bit 0 position. */
#define USART_INTDLY_1_bm  (1<<5)  /* Inter-byte Delay bit 1 mask. */
#define USART_INTDLY_1_bp  5  /* Inter-byte Delay bit 1 position. */
#define USART_INTDLY_2_bm  (1<<6)  /* Inter-byte Delay bit 2 mask. */
#define USART_INTDLY_2_bp  6  /* Inter-byte Delay bit 2 position. */
#define USART_INTDLY_3_bm  (1<<7)  /* Inter-byte Delay bit 3 mask. */
#define USART_INTDLY_3_bp  7  /* Inter-byte Delay bit 3 position. */

/* USART.CTRLG  bit masks and bit positions */
#define USART_PROTCONV_gm  0x07  /* Protocol Converter group mask. */
#define USART_PROTCONV_gp  0  /* Protocol Converter group position. */
#define USART_PROTCONV_0_bm  (1<<0)  /* Protocol Converter bit 0 mask. */
#define USART_PROTCONV_0_bp  0  /* Protocol Converter bit 0 position. */
#define USART_PROTCONV_1_bm  (1<<1)  /* Protocol Converter bit 1 mask. */
#define USART_PROTCONV_1_bp  1  /* Protocol Converter bit 1 position. */
#define USART_PROTCONV_2_bm  (1<<2)  /* Protocol Converter bit 2 mask. */
#define USART_PROTCONV_2_bp  2  /* Protocol Converter bit 2 position. */
#define USART_ENC_bm  0x10  /* Encoding bit mask. */
#define USART_ENC_bp  4  /* Encoding bit position. */
#define USART_ABW_gm  0xC0  /* Auto Baud Window group mask. */
#define USART_ABW_gp  6  /* Auto Baud Window group position. */
#define USART_ABW_0_bm  (1<<6)  /* Auto Baud Window bit 0 mask. */
#define USART_ABW_0_bp  6  /* Auto Baud Window bit 0 position. */
#define USART_ABW_1_bm  (1<<7)  /* Auto Baud Window bit 1 mask. */
#define USART_ABW_1_bp  7  /* Auto Baud Window bit 1 position. */

/* USART.COMMAND  bit masks and bit positions */
#define USART_LINCMD_gm  0x03  /* LIN Command group mask. */
#define USART_LINCMD_gp  0  /* LIN Command group position. */
#define USART_LINCMD_0_bm  (1<<0)  /* LIN Command bit 0 mask. */
#define USART_LINCMD_0_bp  0  /* LIN Command bit 0 position. */
#define USART_LINCMD_1_bm  (1<<1)  /* LIN Command bit 1 mask. */
#define USART_LINCMD_1_bp  1  /* LIN Command bit 1 position. */
#define USART_WFBRK_bm  0x04  /* Wait for BREAK bit mask. */
#define USART_WFBRK_bp  2  /* Wait for BREAK bit position. */

/* USART.EVCTRL  bit masks and bit positions */
#define USART_RXEI_bm  0x01  /* Receive Event Input Enable bit mask. */
#define USART_RXEI_bp  0  /* Receive Event Input Enable bit position. */

/* USART.INTCTRL  bit masks and bit positions */
#define USART_DRE_bm  0x01  /* Data Register Empty Interrupt Enable bit mask. */
#define USART_DRE_bp  0  /* Data Register Empty Interrupt Enable bit position. */
#define USART_TXC_bm  0x02  /* Transmit Complete Interrupt Enable bit mask. */
#define USART_TXC_bp  1  /* Transmit Complete Interrupt Enable bit position. */
#define USART_RXC_bm  0x04  /* Receive Complete Interrupt Enable bit mask. */
#define USART_RXC_bp  2  /* Receive Complete Interrupt Enable bit position. */
#define USART_RXS_bm  0x08  /* Receiver Start Frame Interrupt Enable bit mask. */
#define USART_RXS_bp  3  /* Receiver Start Frame Interrupt Enable bit position. */
#define USART_RXBRK_bm  0x10  /* Receive Break Interrupt Enable bit mask. */
#define USART_RXBRK_bp  4  /* Receive Break Interrupt Enable bit position. */
#define USART_CTSIC_bm  0x40  /* Clear to Send Input Change Interrupt Enable bit mask. */
#define USART_CTSIC_bp  6  /* Clear to Send Input Change Interrupt Enable bit position. */
#define USART_ERROR_bm  0x80  /* Error Interrupt Enable bit mask. */
#define USART_ERROR_bp  7  /* Error Interrupt Enable bit position. */

