avrdudes/avr-libc/include/avr/ioavr16la32.h
/* Reference Selection bit group configurations*/
typedef enum ADC_REFSEL_enum
{
    ADC_REFSEL_VDD_gc              = (ADC_REFSEL_VDD_gv << ADC_REFSEL_gp),  /* VDD */
    ADC_REFSEL_EXTVREF_gc          = (ADC_REFSEL_EXTVREF_gv << ADC_REFSEL_gp),  /* External reference from EXTVREF0 pin */
    ADC_REFSEL_0V512_gc            = (ADC_REFSEL_0V512_gv << ADC_REFSEL_gp),  /* Internal reference 0.512 V */
    ADC_REFSEL_1V024_gc            = (ADC_REFSEL_1V024_gv << ADC_REFSEL_gp),  /* Internal reference 1.024 V */
    ADC_REFSEL_2V048_gc            = (ADC_REFSEL_2V048_gv << ADC_REFSEL_gp),  /* Internal reference 2.048 V */
    ADC_REFSEL_4V096_gc            = (ADC_REFSEL_4V096_gv << ADC_REFSEL_gp),  /* Internal reference 4.096 V */
    ADC_REFSEL_2V500_gc            = (ADC_REFSEL_2V500_gv << ADC_REFSEL_gp)   /* Internal reference 2.500 V */
} ADC_REFSEL_t;

/* Sample Accumulation Number Select bit group values */
typedef enum ADC_SAMPNUM_VALUES_enum
{
    ADC_SAMPNUM_NONE_gv            = 0x00,  /* No accumulation, single sample per conversion result */
    ADC_SAMPNUM_ACC2_gv            = 0x01,  /* 2 samples accumulated */
    ADC_SAMPNUM_ACC4_gv            = 0x02,  /* 4 samples accumulated */
    ADC_SAMPNUM_ACC8_gv            = 0x03,  /* 8 samples accumulated */
    ADC_SAMPNUM_ACC16_gv           = 0x04,  /* 16 samples accumulated */
    ADC_SAMPNUM_ACC32_gv           = 0x05,  /* 32 samples accumulated */
    ADC_SAMPNUM_ACC64_gv           = 0x06,  /* 64 samples accumulated */
    ADC_SAMPNUM_ACC128_gv          = 0x07,  /* 128 samples accumulated */
    ADC_SAMPNUM_ACC256_gv          = 0x08,  /* 256 samples accumulated */
    ADC_SAMPNUM_ACC512_gv          = 0x09,  /* 512 samples accumulated */
    ADC_SAMPNUM_ACC1024_gv         = 0x0A   /* 1024 samples accumulated */
} ADC_SAMPNUM_values_t;

/* Sample Accumulation Number Select bit group configurations*/
typedef enum ADC_SAMPNUM_enum
{
    ADC_SAMPNUM_NONE_gc            = (ADC_SAMPNUM_NONE_gv << ADC_SAMPNUM_gp),  /* No accumulation, single sample per conversion result */
    ADC_SAMPNUM_ACC2_gc            = (ADC_SAMPNUM_ACC2_gv << ADC_SAMPNUM_gp),  /* 2 samples accumulated */
    ADC_SAMPNUM_ACC4_gc            = (ADC_SAMPNUM_ACC4_gv << ADC_SAMPNUM_gp),  /* 4 samples accumulated */
    ADC_SAMPNUM_ACC8_gc            = (ADC_SAMPNUM_ACC8_gv << ADC_SAMPNUM_gp),  /* 8 samples accumulated */
    ADC_SAMPNUM_ACC16_gc           = (ADC_SAMPNUM_ACC16_gv << ADC_SAMPNUM_gp),  /* 16 samples accumulated */
    ADC_SAMPNUM_ACC32_gc           = (ADC_SAMPNUM_ACC32_gv << ADC_SAMPNUM_gp),  /* 32 samples accumulated */
    ADC_SAMPNUM_ACC64_gc           = (ADC_SAMPNUM_ACC64_gv << ADC_SAMPNUM_gp),  /* 64 samples accumulated */
    ADC_SAMPNUM_ACC128_gc          = (ADC_SAMPNUM_ACC128_gv << ADC_SAMPNUM_gp),  /* 128 samples accumulated */
    ADC_SAMPNUM_ACC256_gc          = (ADC_SAMPNUM_ACC256_gv << ADC_SAMPNUM_gp),  /* 256 samples accumulated */
    ADC_SAMPNUM_ACC512_gc          = (ADC_SAMPNUM_ACC512_gv << ADC_SAMPNUM_gp),  /* 512 samples accumulated */
    ADC_SAMPNUM_ACC1024_gc         = (ADC_SAMPNUM_ACC1024_gv << ADC_SAMPNUM_gp)   /* 1024 samples accumulated */
} ADC_SAMPNUM_t;

/* Result Scaling select bit group values */
typedef enum ADC_SCALING_VALUES_enum
{
    ADC_SCALING_NORMAL_gv          = 0x00,  /* ADC output of sample or accumulated result is right adjusted. If accumulating more then 64 samples, result is left adjusted */
    ADC_SCALING_LEFTADJ_gv         = 0x01,  /* ADC output is left adjusted */
    ADC_SCALING_AVERAGE_gv         = 0x02   /* Accumulated ADC result is averaged and right adjusted */
} ADC_SCALING_values_t;

/* Result Scaling select bit group configurations*/
typedef enum ADC_SCALING_enum
{
    ADC_SCALING_NORMAL_gc          = (ADC_SCALING_NORMAL_gv << ADC_SCALING_gp),  /* ADC output of sample or accumulated result is right adjusted. If accumulating more then 64 samples, result is left adjusted */
    ADC_SCALING_LEFTADJ_gc         = (ADC_SCALING_LEFTADJ_gv << ADC_SCALING_gp),  /* ADC output is left adjusted */
    ADC_SCALING_AVERAGE_gc         = (ADC_SCALING_AVERAGE_gv << ADC_SCALING_gp)   /* Accumulated ADC result is averaged and right adjusted */
} ADC_SCALING_t;

/* Start Conversion select bit group values */
typedef enum ADC_START_VALUES_enum
{
    ADC_START_STOP_gv              = 0x00,  /* Stop an ongoing conversion */
    ADC_START_IMMEDIATE_gv         = 0x01,  /* Start a conversion immediately. This will be set back to STOP when the first conversion is done, unless Free-Running mode is enabled */
    ADC_START_MUXPOS_gv            = 0x02,  /* Start when a write to the MUXPOS register is done */
    ADC_START_EVENT_gv             = 0x04   /* Start when an event is received by the ADC */
} ADC_START_values_t;

/* Start Conversion select bit group configurations*/
typedef enum ADC_START_enum
{
    ADC_START_STOP_gc              = (ADC_START_STOP_gv << ADC_START_gp),  /* Stop an ongoing conversion */
    ADC_START_IMMEDIATE_gc         = (ADC_START_IMMEDIATE_gv << ADC_START_gp),  /* Start a conversion immediately. This will be set back to STOP when the first conversion is done, unless Free-Running mode is enabled */
    ADC_START_MUXPOS_gc            = (ADC_START_MUXPOS_gv << ADC_START_gp),  /* Start when a write to the MUXPOS register is done */
    ADC_START_EVENT_gc             = (ADC_START_EVENT_gv << ADC_START_gp)   /* Start when an event is received by the ADC */
} ADC_START_t;

/* Window Comparator Mode select bit group values */
typedef enum ADC_WINCM_VALUES_enum
{
    ADC_WINCM_NONE_gv              = 0x00,  /* No Window Comparison */
    ADC_WINCM_BELOW_gv             = 0x01,  /* OUTPUT < WINLT */
    ADC_WINCM_ABOVE_gv             = 0x02,  /* OUTPUT > WINHT */
    ADC_WINCM_INSIDE_gv            = 0x03,  /* WINLT < OUTPUT < WINHT */
    ADC_WINCM_OUTSIDE_gv           = 0x04   /* OUTPUT < WINLT or OUTPUT >WINHT */
} ADC_WINCM_values_t;

/* Window Comparator Mode select bit group configurations*/
typedef enum ADC_WINCM_enum
{
    ADC_WINCM_NONE_gc              = (ADC_WINCM_NONE_gv << ADC_WINCM_gp),  /* No Window Comparison */
    ADC_WINCM_BELOW_gc             = (ADC_WINCM_BELOW_gv << ADC_WINCM_gp),  /* OUTPUT < WINLT */
    ADC_WINCM_ABOVE_gc             = (ADC_WINCM_ABOVE_gv << ADC_WINCM_gp),  /* OUTPUT > WINHT */
    ADC_WINCM_INSIDE_gc            = (ADC_WINCM_INSIDE_gv << ADC_WINCM_gp),  /* WINLT < OUTPUT < WINHT */
    ADC_WINCM_OUTSIDE_gc           = (ADC_WINCM_OUTSIDE_gv << ADC_WINCM_gp)   /* OUTPUT < WINLT or OUTPUT >WINHT */
} ADC_WINCM_t;

/* Window Mode Source select bit group values */
typedef enum ADC_WINSRC_VALUES_enum
{
    ADC_WINSRC_RESULT_gv           = 0x00,  /* Use RESULT[15:0] as Window Comparator Source */
    ADC_WINSRC_SAMPLE_gv           = 0x01   /* Use SAMPLE[15:0] as Window Comparator source */
} ADC_WINSRC_values_t;

/* Window Mode Source select bit group configurations*/
typedef enum ADC_WINSRC_enum
{
    ADC_WINSRC_RESULT_gc           = (ADC_WINSRC_RESULT_gv << ADC_WINSRC_bp),  /* Use RESULT[15:0] as Window Comparator Source */
    ADC_WINSRC_SAMPLE_gc           = (ADC_WINSRC_SAMPLE_gv << ADC_WINSRC_bp)   /* Use SAMPLE[15:0] as Window Comparator source */
} ADC_WINSRC_t;

